app/controllers/api/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    render status: 200, json: {
      songs: Song.all

INSERT INTO "songs" ("name", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "new_song_tobia"], ["created_at", "2017-07-15 13:15:31.081070"], ["updated_at", "2017-07-15 13:15:31.081070"], ["artist_id", 16]]
---
  def create
    set_artist
    @song = @artist.songs.create(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 213]]
---
  def destroy
    set_artist
    set_song
    if @song.destroy

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_artist
    @artist = Artist.find(params[:artist_id])