app/views/artists/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."artist_id" = $1  [["artist_id", 9]]
---
  <div class="col-sm-6 col-md-3">
    <% artist.photos.each do |photo| %>