app/views/artists/show.html.erb

<div class="row">
  <% @artist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 13]]