app/views/artists/show.html.erb

                <% if @artist.respond_to?(:image) == true %>
                <% @artist.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."artist_id" = $1  [["artist_id", 10]]