app/views/songs/_list_songs.html.erb

<ul class="list-group" id="all-songs">
  <% @artist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 10]]