app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
def index
  @artist = Artist.all