app/controllers/artists_controller.rb

  def destroy
    artist
    if @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 7]]