app/controllers/songs_controller.rb

    def create
      @song = @artist.songs.build(song_params)
      if @song.save
---
INSERT INTO "songs" ("name", "length", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["length", "00:00:00"], ["created_at", "2017-07-08 16:08:17.137649"], ["updated_at", "2017-07-08 16:08:17.137649"], ["artist_id", 3]]

    def destroy
      set_song
      if @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 46]]

    def set_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]